[
    {
        "target": "https://moviereviewblogger.co.uk/",
        "title": "Movie Review Blogger",
        "excerpt": "My personal take on the obligatory movie API project. Fullstack MERN project with authentication.",
        "text": [
            "My personal take on the obligatory Movie API project, inspired by such apps as Letterboxd.",
            "Users are able to create an account and securely log in, view the Movie of the Week and leave their review for others to see. Authentication is supplied by JWT and incorporates end-to-end encryption.",
            "This is a full-stack MERN application (mongoDB, Express, React, node.js).",
            "API calls are minimised by use of a scheduled job in the backend, whereby data is fetched only once per day and used to update the movies list."
        ],
        "devIcons": [
            "devicon-react-original-wordmark",
            "devicon-express-original-wordmark",
            "devicon-nodejs-plain-wordmark",
            "devicon-mongodb-plain-wordmark",
            "devicon-ubuntu-plain-wordmark"
        ]
    },
    {
        "target": "https://conwaysapp.co.uk/",
        "title": "Conway's Game of Life",
        "excerpt": "Single-player cellular propagation game. Utilises canvas manipulation with second- and third-order loops.",
        "text": [
            "Conway's Game of Life is a single-player game that visualises cellular propagation.",
            "This project is coded in Typescript and React, and was initialised using Vite.",
            "The animation is painted onto a canvas and undergoes generational 'ticks'. Second- and third-order loops calculate the binary condition of each cell and update the canvas.",
            "The user can select from a list of preset configurations, or create their own by interacting with the canvas.",
            "A certain amount of balancing was required for this application - canvas size, cell population constraints and limits on the tick duration were necessary to ensure reasonable performance in the browser."
        ],
        "devIcons": [
            "devicon-react-original-wordmark",
            "devicon-typescript-plain"
        ]
    },
    {
        "target": "https://mainstcafe.co.uk",
        "title": "Main St. Cafe",
        "excerpt": "Freelance commission for emergent Cafe. Custom Wordpress theme featuring several bespoke plugins.",
        "text": [
            "This website was initially contracted as a single-page website for a newly-opened Cafe in my local area.",
            "I designed a fully custom Wordpress theme using PHP in a local environment, before handling the website testing and launch for the customer.",
            "Since launch, I have implemented regular updates and recently added e-commerce functionality using WooCommerce.",
            "I was keen to adopt a minimal plugin-dependency approach for this project - this ensures that there is 'less to go wrong' and also allowed me to delve further into the underlying PHP of Wordpress development. "
        ],
        "devIcons": [
            "devicon-wordpress-plain-wordmark",
            "devicon-php-plain",
            "devicon-jquery-plain-wordmark",
            "devicon-woocommerce-plain-wordmark"
        ]
    }
]